{
  "plugins": {
    "Comment.nvim": {
      "src": "https://github.com/numToStr/Comment.nvim"
    },
    "auto-session": {
      "src": "https://github.com/rmagatti/auto-session"
    },
    "barbecue.nvim": {
      "src": "https://github.com/utilyre/barbecue.nvim"
    },
    "bufferline.nvim": {
      "src": "https://github.com/akinsho/bufferline.nvim"
    },
    "claudecode.nvim": {
      "src": "https://github.com/coder/claudecode.nvim"
    },
    "cmp-buffer": {
      "src": "https://github.com/hrsh7th/cmp-buffer"
    },
    "cmp-cmdline": {
      "src": "https://github.com/hrsh7th/cmp-cmdline"
    },
    "cmp-look": {
      "src": "https://github.com/octaltree/cmp-look"
    },
    "cmp-nvim-lsp": {
      "src": "https://github.com/hrsh7th/cmp-nvim-lsp"
    },
    "cmp-path": {
      "src": "https://github.com/hrsh7th/cmp-path"
    },
    "committia.vim": {
      "src": "https://github.com/rhysd/committia.vim"
    },
    "dial.nvim": {
      "src": "https://github.com/monaqa/dial.nvim"
    },
    "fyler.nvim": {
      "src": "https://github.com/A7Lavinraj/fyler.nvim"
    },
    "git-blame.nvim": {
      "src": "https://github.com/f-person/git-blame.nvim"
    },
    "gitsigns.nvim": {
      "src": "https://github.com/lewis6991/gitsigns.nvim"
    },
    "indent-blankline.nvim": {
      "src": "https://github.com/lukas-reineke/indent-blankline.nvim"
    },
    "indent-o-matic": {
      "src": "https://github.com/Darazaki/indent-o-matic"
    },
    "lsp_signature.nvim": {
      "src": "https://github.com/ray-x/lsp_signature.nvim"
    },
    "lualine.nvim": {
      "src": "https://github.com/nvim-lualine/lualine.nvim"
    },
    "markdown-preview.nvim": {
      "src": "https://github.com/iamcco/markdown-preview.nvim"
    },
    "mini.bufremove": {
      "src": "https://github.com/echasnovski/mini.bufremove"
    },
    "mini.icons": {
      "src": "https://github.com/nvim-mini/mini.icons"
    },
    "mini.jump2d": {
      "src": "https://github.com/echasnovski/mini.jump2d"
    },
    "noice.nvim": {
      "src": "https://github.com/folke/noice.nvim"
    },
    "none-ls.nvim": {
      "src": "https://github.com/nvimtools/none-ls.nvim"
    },
    "nui.nvim": {
      "src": "https://github.com/MunifTanjim/nui.nvim"
    },
    "numb.nvim": {
      "src": "https://github.com/nacro90/numb.nvim"
    },
    "nvcode-color-schemes.vim": {
      "src": "https://github.com/christianchiarulli/nvcode-color-schemes.vim"
    },
    "nvim-cmp": {
      "src": "https://github.com/hrsh7th/nvim-cmp"
    },
    "nvim-hlslens": {
      "src": "https://github.com/kevinhwang91/nvim-hlslens"
    },
    "nvim-lspconfig": {
      "src": "https://github.com/neovim/nvim-lspconfig"
    },
    "nvim-navic": {
      "src": "https://github.com/SmiteshP/nvim-navic"
    },
    "nvim-notify": {
      "src": "https://github.com/rcarriga/nvim-notify"
    },
    "nvim-treesitter": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter"
    },
    "nvim-treesitter-context": {
      "src": "https://github.com/romgrk/nvim-treesitter-context"
    },
    "nvim-treesitter-textobjects": {
      "src": "https://github.com/nvim-treesitter/nvim-treesitter-textobjects"
    },
    "nvim-ts-context-commentstring": {
      "src": "https://github.com/JoosepAlviste/nvim-ts-context-commentstring"
    },
    "nvim-ufo": {
      "src": "https://github.com/kevinhwang91/nvim-ufo"
    },
    "nvim-web-devicons": {
      "src": "https://github.com/nvim-tree/nvim-web-devicons"
    },
    "octo.nvim": {
      "src": "https://github.com/pwntester/octo.nvim"
    },
    "plenary.nvim": {
      "src": "https://github.com/nvim-lua/plenary.nvim"
    },
    "possession.nvim": {
      "src": "https://github.com/jedrzejboczar/possession.nvim"
    },
    "promise-async": {
      "src": "https://github.com/kevinhwang91/promise-async"
    },
    "quicker.nvim": {
      "src": "https://github.com/stevearc/quicker.nvim"
    },
    "rainbow-delimiters.nvim": {
      "src": "https://github.com/hiphish/rainbow-delimiters.nvim"
    },
    "snacks.nvim": {
      "src": "https://github.com/folke/snacks.nvim"
    },
    "suda.vim": {
      "src": "https://github.com/lambdalisue/suda.vim"
    },
    "telescope-file-browser.nvim": {
      "src": "https://github.com/nvim-telescope/telescope-file-browser.nvim"
    },
    "telescope.nvim": {
      "src": "https://github.com/nvim-telescope/telescope.nvim"
    },
    "text-case.nvim": {
      "src": "https://github.com/johmsalas/text-case.nvim"
    },
    "toggleterm.nvim": {
      "src": "https://github.com/akinsho/toggleterm.nvim"
    },
    "treesj": {
      "src": "https://github.com/Wansmer/treesj"
    },
    "trouble.nvim": {
      "src": "https://github.com/folke/trouble.nvim"
    },
    "ts-node-action": {
      "src": "https://github.com/ckolkey/ts-node-action"
    },
    "undotree": {
      "src": "https://github.com/mbbill/undotree"
    },
    "vim-ambicmd": {
      "src": "https://github.com/thinca/vim-ambicmd"
    },
    "vim-asterisk": {
      "src": "https://github.com/haya14busa/vim-asterisk"
    },
    "vim-easy-align": {
      "src": "https://github.com/junegunn/vim-easy-align"
    },
    "vim-ingo-library": {
      "src": "https://github.com/inkarkat/vim-ingo-library"
    },
    "vim-manpager": {
      "src": "https://github.com/lambdalisue/vim-manpager"
    },
    "vim-mark": {
      "src": "https://github.com/inkarkat/vim-mark"
    },
    "vim-niceblock": {
      "src": "https://github.com/kana/vim-niceblock"
    },
    "vim-operator-flashy": {
      "src": "https://github.com/haya14busa/vim-operator-flashy"
    },
    "vim-operator-replace": {
      "src": "https://github.com/kana/vim-operator-replace"
    },
    "vim-operator-user": {
      "src": "https://github.com/kana/vim-operator-user"
    },
    "vim-repeat": {
      "src": "https://github.com/tpope/vim-repeat"
    },
    "vim-sandwich": {
      "src": "https://github.com/machakann/vim-sandwich"
    },
    "vim-textobj-entire": {
      "src": "https://github.com/kana/vim-textobj-entire"
    },
    "vim-textobj-parameter": {
      "src": "https://github.com/sgur/vim-textobj-parameter"
    },
    "vim-textobj-user": {
      "src": "https://github.com/kana/vim-textobj-user"
    },
    "vim-wordmotion": {
      "src": "https://github.com/chaoren/vim-wordmotion"
    },
    "which-key.nvim": {
      "src": "https://github.com/folke/which-key.nvim"
    },
    "yankround.vim": {
      "src": "https://github.com/LeafCage/yankround.vim"
    }
  }
}
